[
    {
        "id":1,
        "title": "Burger",
        "image": "/images/backend/burger.png",
        "description": "Burger: Is a burger ordering program. It does not actually place a burger order but rather a simulation. User enters what they want in the textarea and it will populate a spot in ordered: section, when the user clicks devour it, the burger order will be sent over to devoured. Thus completeing the application. This application used MySQL, Express, NodeJS and handlebars to populate the different burger orders.",
        "githubLink":"https://github.com/Ericcwong/burger",
        "deployedLink": "https://ericcwong-burger.herokuapp.com/"
    },
    {
        "id":2,
        "title": "Employee Tracker",
        "image": "/images/backend/employeeTracker.png",
        "description": "Employee Tracker: Is a Node.js application that keeps track of any companies managers, employees, department, roles, and salary. Employee Tracker runs completely off of command-line, in order to get it to work. You would have to clone the repo from Github and follow the steps listed in the Github page",
        "githubLink":"https://github.com/Ericcwong/Employee-Tracker",
        "deployedLink": false
    },
    {
        "id":3,
        "title": "NodeJs PDF generator",
        "image": "/images/backend/nodeJs.png",
        "description": "NodeJs PDF generator: Creates a PDF file according to what Github profile has been entered. Creating a simple way to view a Github profile quick and easily.",
        "githubLink":"https://github.com/Ericcwong/NodeJS",
        "deployedLink": false
    },
    {
        "id":4,
        "title": "Template Engine",
        "image": "/images/backend/templateEngine.png",
        "description": "Template Engine: Template Engine is another PDF genertator, instead of generator one subject. Template Engine generates team cards according to entered roles of given.",
        "githubLink":"https://github.com/Ericcwong/Template-Engine",
        "deployedLink": false
    },
    {
        "id":5,
        "title": "Employee Directory",
        "image": "/images/backend/burger.png",
        "description": "Employee Directory is an application that allows the manager manage their staff. You are able to add new staff to the current roaster and or find quick information about current employees.",
        "githubLink":"https://github.com/Ericcwong/Employee-Directory2.0",
        "deployedLink": "https://ericcwong-employee-directory.herokuapp.com/"
    },
    {
        "id":6,
        "title": "Budget Tracker",
        "image": "/images/backend/budgetTracker.png",
        "description": "Budget Tracker is an application that will help you keep track with your spendings! Depending what you do will affect the chart accordingly. If you add funds the chart will go up and if you subtract funds the chart will go down. The best thing about this tracker is that it will work offline! Meaning if you do not have internet connection, you are still able to add or subtract funds and when you do have internet connection. The cached data will be transfered to the online database!",
        "githubLink":"https://github.com/Ericcwong/Budget-Tracker",
        "deployedLink": "https://ericcwong-budget-tracker.herokuapp.com/"
    },
    {
        "id":7,
        "title": "Workout Tracker",
        "image": "/images/backend/workoutTracker.png",
        "description": "Workout Tracker is a tool that helps you keep track of your workout reps, sets, total amount of weight lifted and more! Workout tracker has a dashboard that will display your progress through out the different types of workouts either being resistance or cardio.",
        "githubLink":"https://github.com/Ericcwong/Workout-Tracker",
        "deployedLink": "https://ericcwong-workout-tracker.herokuapp.com/"
    },
    {
        "id":8,
        "title": "Note Taker",
        "image": "/images/backend/noteTaker.png",
        "description": "This is an application for users who want to take quick notes. User could add as much each individual notes as they want, once the note is no longer valid. The user can click on the red trash can to get rid of the note.",
        "githubLink":"https://github.com/Ericcwong/Note-Taker",
        "deployedLink": "https://ericcwong-note-taker.herokuapp.com/"
    }


]